<?php

use Illuminate\Database\Seeder;

class DepartmentsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        DB::table('departments')->insert([
            ['name' => 'Кафедра іноземних мов'],
            ['name' => 'Кафедра процесів та обладнання хімічних і нафтопереробних виробництв'],
            ['name' => 'Кафедра хіміко-технологічна'],
            ['name' => 'Кафедра електроніки, загальної та прикладної фізики'],
            ['name' => 'Кафедра електроніки і комп’ютерної техніки'],
            ['name' => 'Кафедра електроенергетики'],
            ['name' => 'Кафедра прикладної математики та моделювання складних систем'],
            ['name' => 'Кафедра наноелектроніки'],
            ['name' => 'Кафедра комп’ютерних наук (секція Інформаційні технології проектування)'],
            ['name' => 'Кафедра комп’ютерних наук (секція Інформаційно-комунікаційних технологій)'],
            ['name' => 'Кафедра комп’ютерних наук (секція Комп’ютеризовані системи управління)'],
            ['name' => 'Кафедра бухгалтерського обліку та оподаткування'],
            ['name' => 'Кафедра економічної кібернетики'],
            ['name' => 'Кафедра міжнародних економічних відносин'],
            ['name' => 'Кафедра фінансів, банківської справи та страхування'],
            ['name' => 'Кафедра технології машинобудування, верстати та інструменти'],
            ['name' => 'Кафедра загальної механіки і динаміки машин'],
            ['name' => 'Кафедра прикладного матеріалознавства і технології конструкційних матеріалів'],
            ['name' => 'Кафедра прикладної екології'],
            ['name' => 'Кафедра технічної теплофізики'],
            ['name' => 'Кафедра управління'],
            ['name' => 'Кафедра фінансів і підприємництва'],
            ['name' => 'Кафедра економіки, підприємництва та бізнес-адміністрування'],
            ['name' => 'Кафедра маркетингу та управління інноваційною діяльністю'],
            ['name' => 'Кафедра внутрішньої медицини післядипломної освіти'],
            ['name' => 'Кафедра педіатрії'],
            ['name' => 'Кафедра стоматології'],
            ['name' => 'Кафедра громадського здоров\'я'],
            ['name' => 'Кафедра морфології'],
            ['name' => 'Кафедра фізіології і патофізіології з курсом медичної біології'],
            ['name' => 'Кафедра фізичного виховання і спорту'],
            ['name' => 'Кафедра фізичної реабілітації та спортивної медицини'],
            ['name' => 'Кафедра хірургії та онкології'],
            ['name' => 'Кафедра журналістики та філології'],
            ['name' => 'Кафедра германської філології'],
            ['name' => 'Кафедра психології, політології та соціокультурних технологій'],
            ['name' => 'Кафедра прикладної гідроаеромеханіки'],
            ['name' => 'Кафедра кримінально-правових дисциплін та судочинства'],
            ['name' => 'Кафедра адміністративного, господарського права та фінансово-економічної безпеки'],
            ['name' => 'Конотопський інститут'],
            ['name' => 'Кафедра електронних приладів і автоматики Конотопського інституту'],
            ['name' => 'Кафедра фундаментальних та загальнонаукових дисциплін Конотопського інституту'],
            ['name' => 'Кафедра економіки і управління Конотопського інституту'],
            ['name' => 'Машинобудівний коледж СумДУ'],
            ['name' => 'Кафедра філософії'],
            ['name' => 'Кафедра економіки та управління Шосткинського інституту'],
            ['name' => 'Кафедра хімічної технології високомолекулярних сполук Шосткинського інституту'],
            ['name' => 'Кафедра системотехніки та інформаційних технологій Шосткинського інституту'],
            ['name' => 'Кафедра теоретичної та прикладної хімії'],
            ['name' => 'Індустріально-педагогічний технікум КІ СумДУ']
        ]);
    }
}
